/************************************************************************************************
*                                   SRWF-6009
*    (c) Copyright 2015, Software Department, Sunray Technology Co.Ltd
*                               All Rights Reserved
*
* FileName     : Version.h
* Description  :
* Version      :
* Function List:
*------------------------------Revision History--------------------------------------------------
* No.   Version     Date            Revised By      Item            Description
* 1     V1.0        10/08/2015      Zhangxp         SRWF-6009       Original Version
************************************************************************************************/

#ifndef  VERSION_H
#define  VERSION_H

/************************************************************************************************
*   版本发布列表
************************************************************************************************/

#define SR_6009JZQ_AJLSB_20171018_V100                    1	// 第一版
#define SR_6009JZQ_AJLSB_20171023_V110                    2	// 第二版
#define SR_6009JZQ_AJLSB_20171108_V120                    3	// 第三版
#define SR_6009JZQ_AJLSB_20171204_V130                    4

// 当前使用的版本
#define CURRENT_VERSION                             SR_6009JZQ_AJLSB_20171204_V130


/************************************************************************************************
*   版本详细描述信息
************************************************************************************************/

#if (CURRENT_VERSION == SR_6009JZQ_AJLSB_20171018_V100)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.
2.
3.
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0100      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
//key1 = "SRWF-6009-JZQ-", key2 = "-Vsp"
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-AJLSB-20171018-Vsp1.00"//"SRWF-6009-JZQ-20170522-Vsp2.00"

#endif

#if (CURRENT_VERSION == SR_6009JZQ_AJLSB_20171023_V110)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.增加了从服务器获取 RTC 的方式。
2.修复了从网络获取校时的准确性。
3.
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0110      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
//key1 = "SRWF-6009-JZQ-", key2 = "-Vsp"
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-AJLSB-20171023-Vsp1.10"

#endif

#if (CURRENT_VERSION == SR_6009JZQ_AJLSB_20171108_V120)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.通过客户代码来设置集中器信道。
2.修改gprs登录帧中的设备地址，改为 SR(53 52)+集中器号。
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0120      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
//key1 = "SRWF-6009-JZQ-", key2 = "-Vsp"
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-AJLSB-20171108-Vsp1.20"

#endif

#if (CURRENT_VERSION == SR_6009JZQ_AJLSB_20171204_V130)
/*-----------------------------------------------------------------------------------------------
软件说明:
1.通过上位机软件设置是否由服务器获取到信道并设置，或者通过上位机软件直接设置信道号。
-----------------------------------------------------------------------------------------------*/
// 条件编译选项:
#define EEPROM_SEL_M01                                      // 选择1M的EEPROM EEPROM_SEL_M512/EEPROM_SEL_M01
/*---------------------------------------------------------------------------------------------*/
// 版本信息
#define SW_VERSION                              0x0130      // 程序版本
#define HW_VERSION                              0x0200      // 硬件版本
#define PT_VERSION                              0x0101      // 协议版本
//key1 = "SRWF-6009-JZQ-", key2 = "-Vsp"
#define SOFTWARE_VERSION_INFO                   "SRWF-6009-JZQ-AJLSB-20171204-Vsp1.30"

#endif


#endif
/**************************************End of file**********************************************/

